Мюнцкабинент_30/src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <registerRecords>AccumulationRegister.ДвиженияМонет</registerRecords>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Монета</name>
      <type>
        <types>CatalogRef.Монеты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКоллекции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчетноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленаЗапросом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДвиженияМонет/ДвиженияМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияМонет</name>
  <comment>Приходные и расходные операции с монетами</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Фактически себестоимость единицы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/InformationRegisters/СтоимостьОбъектовКоллекцинирования/СтоимостьОбъектовКоллекцинирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьОбъектовКоллекцинирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторЦен</name>
    <type>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.ПоступлениеВКоллекцию</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ВидыМонет</types>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/НомерВКоллекции/НомерВКоллекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомерВКоллекции</name>
  <comment>Номера ячеек, в котоых хранится монеты</comment>
  <resources>
    <name>Номер</name>
    <comment>Номер ячейки в альбоме, в котором хранится монета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Монета</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/Documents/Инвентаризация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// сначала запишем номера монет в коллекции
	ЗаписатьНомераМонетВКоллекции ();
	
	// регистр ДвиженияМонет
	Движения.ДвиженияМонет.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		
		Если ТекСтрокаСписок.УчетноеКоличество = ТекСтрокаСписок.ФактическоеКоличество Тогда
			Продолжить
		КонецЕсли;	
		
		// по регистру ДвиженияМонет
		Движение 				= Движения.ДвиженияМонет.Добавить();
		Движение.Период 		= Дата;
		Движение.Объект 		= ТекСтрокаСписок.Монета;
		Движение.Коллекция		= Коллекция;
		Движение.ВидДвижения 	= ?(ТекСтрокаСписок.УчетноеКоличество < ТекСтрокаСписок.ФактическоеКоличество, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Количество		= Макс(ТекСтрокаСписок.УчетноеКоличество - ТекСтрокаСписок.ФактическоеКоличество, ТекСтрокаСписок.ФактическоеКоличество - ТекСтрокаСписок.УчетноеКоличество);
		
		Если Движение.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			ИнформацияПоМонете		= РегистрыНакопления.ДвиженияМонет.ПолучитьИнформациюПоОбъекту(ТекСтрокаСписок.Монета, Дата); 
			Если ИнформацияПоМонете.Свойство ("Стоимость") Тогда
				Стоимость = ИнформацияПоМонете.Стоимость
			Иначе
				Стоимость = 0
			КонецЕсли;
		Иначе
			Стоимость = ТекСтрокаСписок.Цена 
		КонецЕсли;
		
		Движение.Стоимость		= Стоимость;

		// по регистру СтоимостьОбъектовКоллекционирования
		Если ТекСтрокаСписок.УчетноеКоличество < ТекСтрокаСписок.ФактическоеКоличество Тогда
			РегистрыСведений.СтоимостьОбъектовКоллекцинирования.ЗаписатьИнформациюОСтоимости(ТекСтрокаСписок.Монета, Справочники.ТипыЦен.Оценочная, Стоимость, Дата, Ссылка)
		КонецЕсли;	
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНомераМонетВКоллекции ()
	Для Каждого Строка ИЗ Список Цикл
		Если Строка.НомерВКоллекции <> 0 Тогда
			РегистрыСведений.НомерВКоллекции.ЗаписатьНомер(Строка.Монета, Строка.НомерВКоллекции)
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
